"Western (Mac OS Roman)" = "Länsimainen (Mac OS Roman)";
"Japanese (Mac OS)" = "Japanilainen (Mac OS)";
"Traditional Chinese (Mac OS)" = "Perinteinen kiinalainen (Mac OS)";
"Korean (Mac OS)" = "Korealainen (Mac OS)";
"Arabic (Mac OS)" = "Arabialainen (Mac OS)";
"Hebrew (Mac OS)" = "Heprealainen (Mac OS)";
"Greek (Mac OS)" = "Kreikkalainen (Mac OS)";
"Cyrillic (Mac OS)" = "Kyrillinen (Mac OS)";
"Devanagari (Mac OS)" = "Devanagari (Mac OS)";
"Gurmukhi (Mac OS)" = "Gurmukhi (Mac OS)";
"Gujarati (Mac OS)" = "Gujarati (Mac OS)";
"Thai (Mac OS)" = "Thai (Mac OS)";
"Simplified Chinese (Mac OS)" = "Yksinkertaistettu kiinalainen (Mac OS)";
"Tibetan (Mac OS)" = "Tiibetiläinen (Mac OS)";
"Central European (Mac OS)" = "Keskieurooppalainen (Mac OS)";
"Symbol (Mac OS)" = "Symbol (Mac OS)";
"Dingbats (Mac OS)" = "Dingbats (Mac OS)";
"Turkish (Mac OS)" = "Turkkilainen (Mac OS)";
"Croatian (Mac OS)" = "Kroatialainen (Mac OS)";
"Icelandic (Mac OS)" = "Islantilainen (Mac OS)";
"Romanian (Mac OS)" = "Romanialainen (Mac OS)";
"Celtic (Mac OS)" = "Kelttiläinen (Mac OS)";
"Gaelic (Mac OS)" = "Gaelilainen (Mac OS)";
"Keyboard Symbols (Mac OS)" = "Näppäimistösymbolit (Mac OS)";
"Farsi (Mac OS)" = "Farsi (Mac OS)";
"Cyrillic (Mac OS Ukrainian)" = "Kyrillinen (Mac OS Ukrainian)";
"Inuit (Mac OS)" = "Inuittilainen (Mac OS)";
"Unicode (UTF-16)" = "Unicode (UTF-16)";
"Unicode (UTF-7)" = "Unicode (UTF-7)";
"Unicode (UTF-8)" = "Unicode (UTF-8)";
"Unicode (UTF-32)" = "Unicode (UTF-32)";
"Unicode (UTF-16BE)" = "Unicode (UTF-16BE)";
"Unicode (UTF-16LE)" = "Unicode (UTF-16LE)";
"Unicode (UTF-32BE)" = "Unicode (UTF-32BE)";
"Unicode (UTF-32LE)" = "Unicode (UTF-32LE)";
"Western (ISO Latin 1)" = "Länsimainen (ISO Latin 1)";
"Central European (ISO Latin 2)" = "Keskieurooppalainen (ISO Latin 2)";
"Western (ISO Latin 3)" = "Länsimainen (ISO Latin 3)";
"Central European (ISO Latin 4)" = "Keskieurooppalainen (ISO Latin 4)";
"Cyrillic (ISO 8859-5)" = "Kyrillinen (ISO 8859-5)";
"Arabic (ISO 8859-6)" = "Arabialainen (ISO 8859-6)";
"Greek (ISO 8859-7)" = "Kreikkalainen (ISO 8859-7)";
"Hebrew (ISO 8859-8)" = "Heprealainen (ISO 8859-8)";
"Turkish (ISO Latin 5)" = "Turkkilainen (ISO Latin 5)";
"Nordic (ISO Latin 6)" = "Pohjoismainen (ISO Latin 6)";
"Thai (ISO 8859-11)" = "Thai (ISO 8859-11)";
"Baltic (ISO Latin 7)" = "Baltialainen (ISO Latin 7)";
"Celtic (ISO Latin 8)" = "Kelttiläinen (ISO Latin 8)";
"Western (ISO Latin 9)" = "Länsimainen (ISO Latin 9)";
"Romanian (ISO Latin 10)" = "Romanialainen (ISO Latin 10)";
"Latin-US (DOS)" = "US latin (DOS)";
"Greek (DOS)" = "Kreikkalainen (DOS)";
"Baltic (DOS)" = "Baltialainen (DOS)";
"Western (DOS Latin 1)" = "Länsimainen (DOS Latin 1)";
"Greek (DOS Greek 1)" = "Kreikkalainen (DOS Greek 1)";
"Central European (DOS Latin 2)" = "Keskieurooppalainen (DOS Latin 2)";
"Cyrillic (DOS)" = "Kyrillinen (DOS)";
"Turkish (DOS)" = "Turkkilainen (DOS)";
"Portuguese (DOS)" = "Portugalilainen (DOS)";
"Icelandic (DOS)" = "Islantilainen (DOS)";
"Hebrew (DOS)" = "Heprealainen (DOS)";
"Canadian French (DOS)" = "Kanadanranskalainen (DOS)";
"Arabic (DOS)" = "Arabialainen (DOS)";
"Nordic (DOS)" = "Pohjoismainen (DOS)";
"Russian (DOS)" = "Venäläinen (DOS)";
"Greek (DOS Greek 2)" = "Kreikkalainen (DOS Greek 2)";
"Thai (Windows, DOS)" = "Thai (Windows, DOS)";
"Japanese (Windows, DOS)" = "Japanilainen (Windows, DOS)";
"Simplified Chinese (Windows, DOS)" = "Yksinkertaistettu kiinalainen (Windows, DOS)";
"Korean (Windows, DOS)" = "Korealainen (Windows, DOS)";
"Traditional Chinese (Windows, DOS)" = "Perinteinen kiinalainen (Windows, DOS)";
"Western (Windows Latin 1)" = "Länsimainen (Windows Latin 1)";
"Central European (Windows Latin 2)" = "Keskieurooppalainen (Windows Latin 2)";
"Cyrillic (Windows)" = "Kyrillinen (Windows)";
"Greek (Windows)" = "Kreikkalainen (Windows)";
"Turkish (Windows Latin 5)" = "Turkkilainen (Windows Latin 5)";
"Hebrew (Windows)" = "Heprealainen (Windows)";
"Arabic (Windows)" = "Arabialainen (Windows)";
"Baltic (Windows)" = "Baltialainen (Windows)";
"Vietnamese (Windows)" = "Vietnamilainen (Windows)";
"Western (ASCII)" = "Länsimainen (ASCII)";
"Japanese (Shift JIS X0213)" = "Japanilainen (Shift JIS X0213)";
"Chinese (GBK)" = "Kiinalainen (GBK)";
"Chinese (GB 18030)" = "Kiinalainen (GB 18030)";
"Japanese (ISO 2022-JP)" = "Japanilainen (ISO 2022-JP)";
"Japanese (ISO 2022-JP-2)" = "Japanilainen (ISO 2022-JP-2)";
"Japanese (ISO 2022-JP-1)" = "Japanilainen (ISO 2022-JP-1)";
"Chinese (ISO 2022-CN)" = "Kiinalainen (ISO 2022-CN)";
"Korean (ISO 2022-KR)" = "Korealainen (ISO 2022-KR)";
"Japanese (EUC)" = "Japanilainen (EUC)";
"Simplified Chinese (GB 2312)" = "Yksinkert. kiinalainen (GB 2312)";
"Traditional Chinese (EUC)" = "Perinteinen kiinalainen (EUC)";
"Korean (EUC)" = "Korealainen (EUC)";
"Japanese (Shift JIS)" = "Japanilainen (Shift JIS)";
"Cyrillic (KOI8-R)" = "Kyrillinen (KOI8-R)";
"Traditional Chinese (Big 5)" = "Perinteinen kiinalainen (Big 5)";
"Western (Mac Mail)" = "Länsimainen (Mac Mail)";
"Simplified Chinese (HZ GB 2312)" = "Yksinkertaistettu kiinalainen (HZ GB 2312)";
"Traditional Chinese (Big 5 HKSCS)" = "Perinteinen kiinalainen (Big 5 HKSCS)";
"Ukrainian (KOI8-U)" = "Ukrainalainen (KOI8-U)";
"Traditional Chinese (Big 5-E)" = "Perinteinen kiinalainen (Big 5-E)";
"Western (NextStep)" = "Länsimainen (NextStep)";
"Non-lossy ASCII" = "Lyhentämätön ASCII";
"Western (EBCDIC Latin Core)" = "Länsimainen (EBCDIC Latin Core)";
"Western (EBCDIC Latin 1)" = "Länsimainen (EBCDIC Latin 1)";
"Japanese (Auto Detect)" = "Japanilainen (automaattitunnistus)";
